# Compound Structure Layer Class

Source: https://www.revitapidocs.com/2026/faece83a-6d49-41b0-2713-fe6cfaa5a3b5.htm

---

| Compound Structure Layer Class |
| --- |

Describes a single layer in a CompoundStructure. Inheritance Hierarchy System Object
Autodesk.Revit.DB CompoundStructureLayer

**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public class CompoundStructureLayer : IDisposable
```

```
Public Class CompoundStructureLayer
	Implements IDisposable
```

```
public ref class CompoundStructureLayer : IDisposable
```

```
type CompoundStructureLayer =
    class
        interface IDisposable
    end
```
The CompoundStructureLayer type exposes the following members.

Constructors

|  | Name | Description |
| --- | --- | --- |
|  | CompoundStructureLayer | Creates a compound structure layer using default settings. |
|  | CompoundStructureLayer(CompoundStructureLayer) | Creates a copy of a compound structure layer. |
|  | CompoundStructureLayer(Double, MaterialFunctionAssignment, ElementId) | Creates a default compound structure layer based on the given width, function and material element id. The priority is initialized with 999\. |

Top Properties

|  | Name | Description |
| --- | --- | --- |
|  | DeckEmbeddingType | Embedding type for structural deck \- only for a layer whose function is StructuralDeck. |
|  | DeckProfileId | The ElementId of the structural deck profile \- only for a layer whose function is StructuralDeck. |
|  | Function | The function of the layer. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | LayerCapFlag | Identifies if the layer participates in wrapping at end caps and/or inserts. |
|  | LayerId | The id of the layer \- note that this may be different from the index in the array of layers in a CompoundStructure. |
|  | LayerPriority | The priority of the layer. |
|  | MaterialId | Id of the material assigned to this layer. |
|  | Width | Width of the layer. |

Top Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the CompoundStructureLayer |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top See Also

#### Reference

Autodesk.Revit.DB Namespace